---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShape
source: html/0a370e32-eaba-785e-7e1f-9330929525fc.htm
---
# Autodesk.Revit.DB.Structure.RebarShape

RebarShape specifies the shape type for a Rebar instance.

## Syntax (C#)
```csharp
public class RebarShape : ElementType
```